Repository: Abdualsslam/moodmap
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: MoodMap
ar: خريطة المزاج

# todayMood
source: Today’s Mood
ar: مزاج اليوم

source: Settings
ar: الإعدادات

# howAreYouFeeling
source: How are you feeling today?
ar: كيف هو مزاجك اليوم؟

# moodPlaceholder
source: What made you feel this way?
ar: ما الذي جعلك تشعر هكذا؟

# saveMood
source: Save the Mood
ar: احفظ المزاج

# tabToday
source: Today
ar: اليوم

# tabCalendar
source: Calendar
ar: التقويم

# tabReflections
source: Reflections
ar: تأملات

# sampleDate
source: Sunday, April 13, 2025
ar: الأحد، 13 أبريل 2025

# emptyMoodWarning
source: Please write something about your mood before saving.
ar: يرجى كتابة شيء عن مزاجك قبل الحفظ.

# emptyMoodError
source: Please select a mood before saving.
ar: يرجى اختيار المزاج قبل الحفظ.

# emptyTextFieldError
source: Please write something about your mood before saving.
ar: يرجى كتابة شيء عن مزاجك قبل الحفظ.

source: Reflections
ar: تأملات

source: Space for your mood
ar: مساحة لمزاجك

source: Mood Calendar
ar: تقويم المزاج

# savedMessg
source: The mood was successfully saved ✅
ar: تم حفظ المزاج بنجاح ✅

# chooseModeFirst
source: Choose your mood first
ar: اختر المزاج أولاً

source: Language
ar: اللغة

# shareMoodStats
source: Check out my mood stats!
ar: اطلع على إحصائيات مزاجي!

# shareSuccess
source: Shared successfully!
ar: تمت المشاركة بنجاح!

# shareError
source: An error occurred while sharing:
ar: حدث خطأ أثناء المشاركة:

source: Mood Count
ar: عدد المزاج

source: Edit
ar: تعديل

# hintMyMood
source: My Mood today is
ar: مزاجي اليوم هو

source: Cancel
ar: إلغاء

source: Save
ar: حفظ

# errorFutureDate
source: You can't select future dates.
ar: ؟!!لا يمكنك اختيار أيام في المستقبل.

source: Week
ar: أسبوع

source: Month
ar: شهر

# filterTooltipActive
source: Filter is active
ar: تم تفعيل الفلتر

# filterTooltipInactive
source: Filter by mood
ar: فلترة حسب المزاج

# quoteCopied
source: Quote copied to clipboard!
ar: تم نسخ الاقتباس!

# shareQuoteSubject
source: Share quote
ar: مشاركة اقتباس

source: Remove from favorites
ar: إزالة من المفضلة

source: Favorites
ar: المفضلة

# noFavorites
source: You haven't added any favorites yet!
ar: لم تقم بإضافة أي اقتباس مفضل بعد!

# quoteCopiedAr
source: Quote copied!
ar: تم نسخ الاقتباس!

# shareQuoteArSubject
source: Share quote
ar: مشاركة اقتباس

# toggleFavorite
source: Add to favorites
ar: إضافة إلى المفضلة

# madeWithLove
source: Made with care by
ar: صُنع بِـعنايــة مـــنــــ

# unexpectedError
source: An unexpected error occurred.
ar: حدث خطأ غير متوقع.

source: Successful
ar: تم بنجاح

# thanksForSharing
source: Thank you for sharing
ar: شكراً للمشاركة

# themeDark
source: Dark
ar: ليلي

# themeLight
source: Light
ar: نهاري

source: Theme
ar: الوضع الداكن

source: Happy
ar: سعيد

source: Okay
ar: تمام

source: Bad
ar: سيء

source: good
ar: جيد

source: Awfull
ar: منزعج

source: January
ar: يناير

source: February
ar: فبراير

source: March
ar: مارس

source: April
ar: أبريل

source: May
ar: مايو

source: June
ar: يونيو

source: July
ar: يوليو

source: August
ar: أغسطس

source: September
ar: سبتمبر

source: October
ar: أكتوبر

source: November
ar: نوفمبر

source: December
ar: ديسمبر

# sunday
source: Sun
ar: أحد

# monday
source: Mon
ar: اثنين

# tuesday
source: Tue
ar: ثلاثاء

# wednesday
source: Wed
ar: أربعاء

# thursday
source: Thu
ar: خميس

# friday
source: Fri
ar: جمعة

# saturday
source: Sat
ar: سبت

# quote_1
source: Your feelings are valid. Take a deep breath, you’re doing your best.
ar: مشاعرك حقيقية. خذ نفسًا عميقًا، أنت تبذل ما بوسعك.

# quote_2
source: It’s okay to have bad days. You’re stronger than you think.
ar: لا بأس بوجود أيام سيئة. أنت أقوى مما تعتقد.

# quote_3
source: Every emotion you feel matters.
ar: كل شعور تشعر به مهم.

# quote_4
source: Progress is not linear. Keep moving forward.
ar: التقدم ليس خطًا مستقيمًا. واصل المضي قدمًا.

# quote_5
source: Be kind to yourself. Growth takes time.
ar: كن لطيفًا مع نفسك. النمو يحتاج وقتًا.

# quote_6
source: You are more than your bad moments.
ar: أنت أكثر من لحظاتك السيئة.

# quote_7
source: Take a moment for yourself today.
ar: خذ لحظة لنفسك اليوم.

# quote_8
source: Let go of what you can’t control.
ar: تخلى عن ما لا يمكنك السيطرة عليه.

# quote_9
source: Self-care is how you take your power back.
ar: العناية الذاتية هي استعادة قوتك.

# quote_10
source: You don’t have to have it all figured out.
ar: ليس عليك أن تعرف كل شيء الآن.

# quote_11
source: Healing isn’t always pretty, but it’s worth it.
ar: الشفاء ليس دائمًا جميلًا، لكنه يستحق.

# quote_12
source: You’re allowed to rest.
ar: مسموح لك أن ترتاح.

# quote_13
source: Today’s mood doesn’t define your whole journey.
ar: مزاج اليوم لا يحدد رحلتك كلها.

# quote_14
source: Celebrate small victories.
ar: احتفل بالانتصارات الصغيرة.

# quote_15
source: Your journey is unique. Trust your process.
ar: رحلتك فريدة. ثق في مسارك.

# quote_16
source: It's okay to feel. Emotions make us human.
ar: لا بأس أن تشعر. المشاعر تجعلنا بشرًا.

# quote_17
source: Lighten your heart. Tomorrow is a new day.
ar: خفف قلبك. غدًا يوم جديد.

# quote_18
source: You’re not alone in how you feel.
ar: لست وحدك في مشاعرك.

# quote_19
source: Peace begins with a deep breath.
ar: السلام يبدأ بنفس عميق.

# quote_20
source: Speak to yourself with kindness.
ar: تحدث مع نفسك بلطف.
